[
  {
    "title": "No-Grill Pork Ribs Barbecue",
    "page_link": "./pages/nogrill-pork-ribs-bbq.html",
    "image_link": "https://panlasangpinoy.com/wp-content/uploads/2024/08/Pork-Ribs-222x222.jpg",
    "description": "No grill? No problem! This No-Grill Pork Ribs Barbecue recipe is here to save the day with mouth-watering flavor. Try it now and let us know how it turns out!",
    "time": {
      "prep": "30 minutes",
      "cook": "30 minutes",
      "total": "1 hour"
    },
    "ingredients": {
      "main": [
        "3 lbs. pork ribs sliced into serving pieces",
        "2 cups water",
        "2 tablespoons cooking oil"
      ],
      "Marinade ingredients": [
        "3 tablespoons Worcestershire sauce",
        "½ cup banana ketchup",
        "2 teaspoons onion powder",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon liquid smoke (optional)",
        "1/2 teaspoon ground black pepper"
      ],
      "Barbecue sauce ingredients": [
        "1 cup banana ketchup",
        "3/4 cup white vinegar",
        "3/4 cup brown sugar",
        "2 teaspoons smoked paprika",
        "1/2 cup water"
      ]
    },
    "instructions": [
      "Arrange the pork ribs in a mixing bowl. Add the marinade ingredients and mix well. Marinate for at least 30 minutes.",
      "Heat cooking oil in a pan. Fry the marinated pork ribs for 1½ minutes per side. Set aside.",
      "Arrange all the fried ribs back in the pan. Pour in 2 cups of water and let it boil. Adjust the heat to a simmer, cover the pan, and continue cooking until the water evaporates completely. Remove the pork ribs from the pan and set them aside.",
      "Add all the barbecue sauce ingredients to the pan. Turn on the heat and stir. Bring it to a simmer.",
      "Add the pork ribs back to the pan. Toss until the ribs are completely coated with the barbecue sauce. Continue cooking for 2 minutes.",
      "Transfer the ribs to a serving plate.",
      "Serve and enjoy!"
    ]
  },
  {
    "title": "Beef Chop Suey",
    "page_link": "./pages/beef-chop-suey.html",
    "image_link": "https://panlasangpinoy.com/wp-content/uploads/2024/07/Beef-Chop-Suey-on-Chop-Sticks-Close-Up-222x222.jpg",
    "description": "Beef Chop Suey is a popular stir-fry dish featuring tender beef cubes cooked with a colorful mix of vegetables like bell peppers, carrots, and onions, all in a savory sauce. Originating from Chinese-American cuisine, it's a hearty and flavorful dish that combines crispy vegetables and rich beef, often served over rice or noodles. This dish highlights the versatility of stir-frying and the rich fusion of flavors that come from blending traditional Chinese techniques with local ingredients",
    "time": {
      "prep": "15 minutes",
      "cook": "15 minutes",
      "total": "30 minutes"
    },
    "ingredients": {
      "main": [
        "1 lb. beef top sirloin sliced into thin pieces",
        "5 cloves garlic minced",
        "1 yellow onion sliced thinly",
        "3 stems green onion cut into 2-inch length",
        "½ head cabbage sliced into serving pieces",
        "2 carrots julienne",
        "1 red bell pepper sliced into thick strips",
        "2 cups snap peas",
        "1 tablespoon soy sauce",
        "3 tablespoons cooking oil",
        "½ cup beef stock",
        "8 grams Maggi Magic Sarap"
      ],
      "Marinade ingredients": [
        "2 tablespoons soy sauce",
        "1 ½ tablespoons oyster sauce",
        "¼ teaspoon baking soda",
        "2 teaspoons cornstarch",
        "¼ teaspoon ground black pepper",
        "1 tablespoon cooking oil"
      ]
    },
    "instructions": [
      "Combine the sliced beef and all the marinade ingredients in a bowl. After that, mix everything well. Set aside for 12 minutes.",
      "Meanwhile, start to partially cook the vegetables. Heat 2 tablespoons of oil in a wide pan. Stir fry the cabbage, snap peas, carrot, and bell pepper for 1 minute. Sprinkle some salt to flavor it and then pour ¼ cup of beef broth. Cover the pan and let the liquid boil. Continue steaming for 1 minute. Then remove the cover of the pan. Let the remaining liquid evaporate. Set the vegetables aside.",
      "Heat the remaining oil on the same pan. Once the oil gets hot, stir-fry the marinated beef until the outside part turns light brown.",
      "Add the minced garlic, white part of the green onion, and sliced onions. Continue to stir-fry until the onion softens.",
      "Add the stir-fried vegetables. Then toss to distribute the ingredients evenly.",
      "Pour 1 tablespoon soy sauce and remaining beef broth. Stir and continue cooking until the sauce thickens.",
      "Season with Maggi Magic Sarap as needed.",
      "Transfer to a serving plate. Share and enjoy!"
    ]
  },
  {
    "title": "Mie Goreng",
    "page_link": "./pages/mie-goreng.html",
    "image_link": "https://panlasangpinoy.com/wp-content/uploads/2024/05/mie-goreng-recipe-222x222.jpg",
    "description": "Mie Goreng, originally from Indonesia, is also enjoyed in the Philippines with local twists. It's a tasty stir-fried noodle dish with eggs, meat, and veggies, commonly found as street food, showcasing the diverse flavors of Southeast Asia.",
    "time": {
      "prep": "14 minutes",
      "cook": "6 minutes",
      "total": "20 minutes"
    },
    "ingredients": {
      "main": [
        "230 grams Egg Noodles",
        "4 ounces chicken breast sliced into serving pieces",
        "3 ounces shrimp deveined and shells removed",
        "3 eggs beaten",
        "1 ¼ cup mung bean sprouts",
        "3 green onions cut into 2-inch pieces",
        "3 baby bok choy chopped",
        "5 cloves garlic minced",
        "1 quart water",
        "4 tablespoons cooking oil"
      ],
      "Sauce ingredients": [
        "3 tablespoons kecap manis",
        "3 tablespoons soy sauce",
        "1 tablespoon oyster sauce",
        "2 tablespoons tomato ketchup",
        "2 teaspoons sambal oelek",
        "2 teaspoons sesame oil"
      ]
    },
    "instructions": [
      "Start by mixing all the sauce ingredients and set aside.",
      "Boil 1 quart of water in a wok. Add Good Life Egg Noodles. Continue boiling while gently stirring for 2 minutes.",
      "Discard the water. Set the noodles aside.",
      "Heat 2 tablespoons of cooking oil. Pour the beaten eggs. Cook the eggs until they become firm.",
      "Cut them into pieces using the tip of your spatula or cooking spoon. Set aside.",
      "Heat the remaining oil in the same pan. Add the garlic. Sauté until it starts to brown.",
      "Add the sliced chicken. Continue sautéing for 2 minutes.",
      "Add the shrimp. Stir-fry for 1 minute.",
      "Add the green onions, bok choy, and mung bean sprouts. Cook this for 1 minute.",
      "Stir in the cooked Good Life Egg Noodles. Toss.",
      "Pour the sauce mixture into the wok. Toss again until all the ingredients are well blended.",
      "Transfer to a serving plate. Share and enjoy!"
    ]
  },
  {
    "title": "Batangas Kaldereta",
    "page_link": "./pages/batangas-kaldereta.html",
    "image_link": "https://panlasangpinoy.com/wp-content/uploads/2024/05/batangas-kaldereta-222x222.jpg",
    "description": "Batangas Kaldereta is a tasty Filipino stew with a rich, flavorful sauce made from liver spread and spices, giving it a savory and slightly spicy kick. It's usually made with beef that's simmered until tender and is packed with garlic, onions, and chili peppers, making it perfect to enjoy with rice.",

    "time": {
      "prep": "15 minutes",
      "cook": "1 hour 15 minutes",
      "total": "1 hour 30 minutes"
    },
    "ingredients": {
      "main": [
        "3 lbs beef chuck sliced into 1 ½ inch cubes",
        "3 pcs red onions chopped",
        "8 cloves garlic chopped",
        "3 oz liver spread",
        "2 tbsp peanut butter optional",
        "1/4 cup cheddar cheese shredded",
        "3 tbsp sweet pickle relish",
        "1 tsp annatto powder",
        "1 tbsp beef powder",
        "3 pcs Thai chili pepper chopped",
        "1/4 cup soy sauce",
        "3 tbsp Worcestershire sauce",
        "4 cups water",
        "3 tbsp margarine",
        "2 tbsp breadcrumbs",
        "salt to taste",
        "ground black pepper to taste"
      ]
    },
    "instructions": [
      "Combine the beef and soy sauce in a bowl. Mix well. Marinate for 30 minutes.",
      "Melt the margarine in a pan. Add the annatto powder and stir.",
      "Add the garlic and sauté until it starts to brown. Add the onion and continue to sauté until it becomes soft.",
      "Add the marinated beef. Sauté until the outer part turns light brown. Make sure to stir frequently while cooking to ensure that all sides are cooked evenly.",
      "Add the Worcestershire sauce and pickle relish. Cook for 2 minutes.",
      "Pour in the water and let it boil.",
      "Add the beef powder. Stir and cover the pan. Simmer until the beef becomes tender.",
      "Add the liver spread, peanut butter (optional), cheese, and chili peppers. Stir until the sauce smoothens. The sauce will thicken partially after a few minutes.",
      "Continue cooking on low heat for 5 minutes. Make sure to stir occasionally to prevent the sauce and meat from sticking to the bottom of the pan.",
      "Add the breadcrumbs. This ingredient will make the sauce thicker.",
      "Season with salt and ground black pepper.",
      "Serve and dig in!"
    ]
  }
]
